import React, { useState } from "react";
import style from "./ProjectsType.module.scss";
import { LuSofa } from "react-icons/lu";
import { BsHouse } from "react-icons/bs";
import { BsBasket } from "react-icons/bs";
import { LuPictureInPicture } from "react-icons/lu";
import { BsBank } from "react-icons/bs";
import { AiOutlineUpCircle } from "react-icons/ai";
import { AiOutlineDownCircle } from "react-icons/ai";

const typesList = [
  {
    id: "3d Interior Rendering",
    icon: <LuSofa className={style.icons__size} />,
    header: "ЗД візуалізація інтерʼєрів",
    text: `За допомогою 3д візуалізації інтерʼєрів ви зможете використати всі переваги сучасних технологій у сфері дизайну .Це дозволить вам відчути всі переваги обраного архітектурного рішення та обʼєднати весь простір в одне ціле.3д візуалізація зробить ваші ідеї реалістичними.
    Ви можете обрати або спальню кімнату в якій бажаєте замінити старі меблі на нові або зробити ремонт всієї кімнати від 0 і до підбору вази на кухонному столі.`,
  },
  {
    id: "3d Exterior Rendering",
    icon: <BsHouse className={style.icons__size} />,
    header: "ЗД візуалізація екстерʼєрів",
    text: `За допомогою 3 д візуалізацій екстерʼєрів ви матимете можливість побачити свій майбутній будинок, дачу, багатоповерховий будинок або цілий квартал з усіма деталями та оточуючим середовищем.
    Завдяки 3 д візуалізації екстерʼєру будівлі ви можете всебічно розглянути  фасади , детально побачити матеріали облицювання, тип покрівлі, обрамлення вікон та дверей, елементи декору , обраний вами або існуючий ландшафт.
    Також в екстерʼєрній візуалізації можна продемонструвати патіо, зону барбекю, дитячі зони,зони для занять спортом або озеленення даху багатоповерхових будинків тощо.`,
  },
  {
    id: "3d Product Rendering",
    icon: <BsBasket className={style.icons__size} />,
    header: "Візуалізації продукту ",
    text: `Дана послуга пропонує створення продукту на різному фоні(білий, кольоровий ,в приміщенні, на полиці тощо).
    Можливість побачити свій продукт до запуску у виробництво дає змогу зекономити ваші кошти та час , та довершувати всі деталі швидко.
    Немає ніякого значення чи ваш проєкт вже готовий і потребує оновлення чи ще на початковій стадії розробки.
    До списку продуктів належать:меблі, елементи декору, техніка, ємності для зберігання та багато інших предметів.`,
  },
  {
    id: "3d Floor Plan",
    icon: <LuPictureInPicture className={style.icons__size} />,
    header: "ЗД план підлоги",
    text: `Послуга 3д план підлоги допомагає легко зрозуміти ваш проєкт ,так як це демонструє загальне планування по поверхах у візуально привабливій формі.Такі плани дають змогу краще зрозуміти масштаб приміщення та меблів відносно один одного ,їхнє розміщення ,гармонійність простору ,розміщення текстур та як вони поєднуються одна з одною .Це чудовий приклад ,як можна відчути свій простір і зрозуміти як його краще заповнити.
    До 3д планів ви можете додати візуалізації конкретних приміщень, які вас цікавлять або всіх кімнат.
    Великим плюсом з проєктування  3д планів є те, що можна наперед передбачити будь які недоліки дизайну всього простору одразу.`,
  },
  {
    id: "Commercial Rendering",
    icon: <BsBank className={style.icons__size} />,
    header: "Комерційні візуалізації",
    text: `Комерційна архітектурна візуалізація надає широкий спектр послуг від офісних приміщень і до архітектурних комплексів. Розробка 3д проєктів -це безпечний спосіб,який дає змогу дізнатись про плюси та мінуси перед початком ремонтних робіт.
    Комерційний рендеринг дає змогу вашим інвесторам побачити їхній майбутній проєкт з будь якою деталізацією ,на будь якому етапі будівництва ,з наявними меблями або з додатковим кастомним моделінгом ,так як вам буде зручно.
    До комерційного рендерингу відносяться такі приміщення:коворкінги, офісні приміщення, зали для переговорів, кафе, ресторани, магазини з різним призначенням,концертні  холи,зали для читання, виставкові зали, рецепції ,зони відпочинку, спортивні зали тощо.`,
  },
];
function ProjectsType() {
  const [showMore, setShowMore] = useState("");
  return (
    <section className={style.container}>
      <h2 className={style.container__title}>some title for block</h2>
      <div className={style.container__box_items}>
        {typesList.map((type) => (
          <div className={style.box_items__type} key={type.id}>
            <div className={style.box_items__icon}>{type.icon}</div>
            <div>
              <div className={style.title__container}>
              <h3 className={style.box_items__title}>{type.header}</h3>
              {showMore === type.id ? (
                <AiOutlineUpCircle
                  className={style.button__show_more}
                  onClick={() => {
                    setShowMore("");
                  }}
                />
              ) : (
                <AiOutlineDownCircle
                  className={style.button__show_more}
                  onClick={() => {
                    setShowMore(type.id);
                  }}
                />
              )}
              </div>
            
             

              <p
                className={
                  showMore === type.id
                    ? style.box_items__description_more
                    : style.box_items__description
                }
              >
                {type.text}
              </p>
            </div>
          </div>
        ))}
      </div>
    </section>
  );
}

export default ProjectsType;
